In [1]:
import numpy as np
import pandas as pd

##### 文本文件讀取：

In [2]:
order = pd.read_csv('meal_order_info.csv', encoding="gbk", sep=",")

##### 通用文本文件讀取方法：

In [3]:
order = pd.read_table(r'meal_order_info.csv', encoding="gbk", sep=",")

##### Excel文件讀取 。xls，xlsx兩種後綴都可以：

In [4]:
detail = pd.read_excel('meal_order_detail.xlsx', sheet_name = None) # sheet_name = None 表示返回所有表
detail.keys() # 仿照字典查看所有的表

dict_keys(['meal_order_detail1', 'meal_order_detail2', 'meal_order_detail3'])

##### 獲取每一張表的內容

In [5]:
detail['meal_order_detail1']

,detail_id,order_id,dishes_id,logicprn_name,parent_class_name,dishes_name,itemis_add,counts,amounts,cost,place_order_time,discount_amt,discount_reason,kick_back,add_inprice,add_info,bar_code,picture_file,emp_id
0,2956,417,610062,NaN,NaN,蒜蓉生蚝,0,1,49,NaN,2016-08-01 11:05:36,NaN,NaN,NaN,0,NaN,NaN,caipu/104001.jpg,1442
1,2958,417,609957,NaN,NaN,蒙古烤羊腿,0,1,48,NaN,2016-08-01 11:07:07,NaN,NaN,NaN,0,NaN,NaN,caipu/202003.jpg,1442
2,2961,417,609950,NaN,NaN,大蒜苋菜,0,1,30,NaN,2016-08-01 11:07:40,NaN,NaN,NaN,0,NaN,NaN,caipu/303001.jpg,1442
3,2966,417,610038,NaN,NaN,芝麻烤紫菜,0,1,25,NaN,2016-08-01 11:11:11,NaN,NaN,NaN,0,NaN,NaN,caipu/105002.jpg,1442
4,2968,417,610003,NaN,NaN,蒜香包,0,1,13,NaN,2016-08-01 11:11:30,NaN,NaN,NaN,0,NaN,NaN,caipu/503002.jpg,1442
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2774,6750,774,610011,NaN,NaN,白饭/大碗,0,1,10,NaN,2016-08-10 21:56:24,NaN,NaN,NaN,0,NaN,NaN,caipu/601005.jpg,1138
2775,6742,774,609996,NaN,NaN,牛尾汤,0,1,40,NaN,2016-08-10 21:56:48,NaN,NaN,NaN,0,NaN,NaN,caipu/201006.jpg,1138
2776,6756,774,609949,NaN,NaN,意文柠檬汁,0,1,13,NaN,2016-08-10 22:01:52,NaN,NaN,NaN,0,NaN,NaN,caipu/404005.jpg,1138
2777,6763,774,610014,NaN,NaN,金玉良缘,0,1,30,NaN,2016-08-10 22:03:58,NaN,NaN,NaN,0,NaN,NaN,caipu/302003.jpg,1138
2778,6764,774,610017,NaN,NaN,酸辣藕丁,0,1,33,NaN,2016-08-10 22:04:30,NaN,NaN,NaN,0,NaN,NaN,caipu/302006.jpg,1138

##### header 表示將第 3 行作為列索引， skiprow 表示忽略第  1 ，2 行

In [6]:
detail = pd.read_excel('meal_order_detail.xlsx', sheet_name = 0, header = 2, skiprows = [0, 1])

In [7]:
detail

,2966,417,610038,NA,NA.1,芝麻烤紫菜,0,1,25,NA.2,2016-08-01 11:11:11,NA.3,NA.4,NA.5,0.1,NA.6,NA.7,caipu/105002.jpg,1442
0,2968,417,610003,NaN,NaN,蒜香包,0,1,13,NaN,2016-08-01 11:11:30,NaN,NaN,NaN,0,NaN,NaN,caipu/503002.jpg,1442
1,1899,301,610019,NaN,NaN,白斩鸡,0,1,88,NaN,2016-08-01 11:15:57,NaN,NaN,NaN,0,NaN,NaN,caipu/204002.jpg,1095
2,1902,301,609991,NaN,NaN,香烤牛排,0,1,55,NaN,2016-08-01 11:19:12,NaN,NaN,NaN,0,NaN,NaN,caipu/201001.jpg,1095
3,1906,301,609983,NaN,NaN,干锅田鸡,0,1,88,NaN,2016-08-01 11:22:21,NaN,NaN,NaN,0,NaN,NaN,caipu/205003.jpg,1095
4,1907,301,609981,NaN,NaN,桂圆枸杞鸽子汤,0,1,48,NaN,2016-08-01 11:22:53,NaN,NaN,NaN,0,NaN,NaN,caipu/205001.jpg,1095
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2770,6750,774,610011,NaN,NaN,白饭/大碗,0,1,10,NaN,2016-08-10 21:56:24,NaN,NaN,NaN,0,NaN,NaN,caipu/601005.jpg,1138
2771,6742,774,609996,NaN,NaN,牛尾汤,0,1,40,NaN,2016-08-10 21:56:48,NaN,NaN,NaN,0,NaN,NaN,caipu/201006.jpg,1138
2772,6756,774,609949,NaN,NaN,意文柠檬汁,0,1,13,NaN,2016-08-10 22:01:52,NaN,NaN,NaN,0,NaN,NaN,caipu/404005.jpg,1138
2773,6763,774,610014,NaN,NaN,金玉良缘,0,1,30,NaN,2016-08-10 22:03:58,NaN,NaN,NaN,0,NaN,NaN,caipu/302003.jpg,1138
2774,6764,774,610017,NaN,NaN,酸辣藕丁,0,1,33,NaN,2016-08-10 22:04:30,NaN,NaN,NaN,0,NaN,NaN,caipu/302006.jpg,1138

##### DataFrame的查詢：

In [8]:
columns = ['Name', 'Age', 'Class', 'PhoneNum', 'IDNum']
data = [['Mary', 20, 1401, '18734444', 1], ['Oz', 21, 1401, '18734445', 2],['Jerry', 20, 1401, '18767442', 3]]
df = pd.DataFrame(columns = columns, data = data)
df

    Name  Age  Class  PhoneNum  IDNum
0   Mary   20   1401  18734444      1
1     Oz   21   1401  18734445      2
2  Jerry   20   1401  18767442      3

##### 基本切片：

In [9]:
df['Name'] #返回一個Series類型。

0     Mary
1       Oz
2    Jerry
Name: Name, dtype: object

In [10]:
df[['Name']] # 返回一個DataFrame類型

    Name
0   Mary
1     Oz
2  Jerry

In [11]:
df[['Name', 'Age']] #多列切片

    Name  Age
0   Mary   20
1     Oz   21
2  Jerry   20

In [12]:
df[['Name', 'Age']][:2] #先切列再切行，返回姓名和年齡列的前兩行

   Name  Age
0  Mary   20
1    Oz   21

##### 靈活切片： loc / iloc

In [13]:
df.loc[:1, ['Name', 'Age']] #前面表示0到1行（包含1），後面表示切姓名和年齡列。

   Name  Age
0  Mary   20
1    Oz   21

In [14]:
df.iloc[:2, [0, 1]] # 前面0到1行，不包含2，後面返回第0，1列。

   Name  Age
0  Mary   20
1    Oz   21

In [15]:
df.loc[df['Age'] < 21, ['Name','PhoneNum']] #返回年齡小於21歲的人的姓名

    Name  PhoneNum
0   Mary  18734444
2  Jerry  18767442

##### Mask 切片

In [16]:
mask = df['Age'] < 21 #返回一個Bool的series
mask

0     True
1    False
2     True
Name: Age, dtype: bool

In [17]:
df.loc[mask,['Name', 'Age']]

    Name  Age
0   Mary   20
2  Jerry   20

##### 更改數據：

In [18]:
df.loc[df['Name'] == 'Mary', 'Age'] = 22 # 直接修改了數據
df

    Name  Age  Class  PhoneNum  IDNum
0   Mary   22   1401  18734444      1
1     Oz   21   1401  18734445      2
2  Jerry   20   1401  18767442      3

##### 增添數據：

In [19]:
df['Gender'] = pd.Series(['F', 'M', 'M']) 直接添加了一列
df

    Name  Age  Class  PhoneNum  IDNum Gender
0   Mary   22   1401  18734444      1      F
1     Oz   21   1401  18734445      2      M
2  Jerry   20   1401  18767442      3      M

In [25]:
df.loc[3] = ['Olivia', 19, 1402, '16098232', 4, 'F'] #也可以用loc 直接添加行

In [26]:
df

     Name  Age  Class  PhoneNum  IDNum Gender
0    Mary   22   1401  18734444      1      F
1      Oz   21   1401  18734445      2      M
2   Jerry   20   1401  18767442      3      M
3  Olivia   19   1402  16098232      4      F

##### 刪除行和列

In [27]:
df.drop(labels = 'PhoneNum', axis = 1) # 1表示對列的刪除

     Name  Age  Class  IDNum Gender
0    Mary   22   1401      1      F
1      Oz   21   1401      2      M
2   Jerry   20   1401      3      M
3  Olivia   19   1402      4      F

In [28]:
df.drop(labels = 0, axis = 0) #0 表示對行的刪除

     Name  Age  Class  PhoneNum  IDNum Gender
1      Oz   21   1401  18734445      2      M
2   Jerry   20   1401  18767442      3      M
3  Olivia   19   1402  16098232      4      F

#### 原來的DataFrame 並沒有被修改，如想要修改添加 inplace = Ture 參數來修改原數據表

In [29]:
df

     Name  Age  Class  PhoneNum  IDNum Gender
0    Mary   22   1401  18734444      1      F
1      Oz   21   1401  18734445      2      M
2   Jerry   20   1401  18767442      3      M
3  Olivia   19   1402  16098232      4      F

### <font color = "red"> 統計分析方法： </font>

##### 1. 用Numpy的部分方法：

In [30]:
np.mean(df['Age']) #求年齡的平均值

20.5

##### 2. Pandas 的統計方法： <font color= "hotpink"> Pandas中有一些Numpy沒有的統計方法 </font>

In [32]:
df['Age'].mean() #一樣是求年齡的平均值

20.5

##### 1）統計非 Nan值：

In [34]:
df['Age'].count()  #返回一個數值：

4

In [47]:
df[['Age']].count()  #返回一個Series

Age    4
dtype: int64

##### 2）統計頻數：

In [46]:
df['Gender'].value_counts()  # 返回一個Series類型 該方法是Series中的方法，在DataFrame中沒有該方法。

M    2
F    2
Name: Gender, dtype: int64

##### 3）众數：

In [48]:
df['Gender'].mode()

0    F
1    M
dtype: object

##### 4)  describe(  ) 返回非空數，平均值，標準差，最小值，最大值及四分衛數

In [51]:
df['Age'].describe()  #返回一個Series類型。

count     4.000000
mean     20.500000
std       1.290994
min      19.000000
25%      19.750000
50%      20.500000
75%      21.250000
max      22.000000
Name: Age, dtype: float64

In [53]:
df[['Age','Name']].describe()  #如果數值型的和字符串型在一起，會自動忽略字符串的統計。

             Age
count   4.000000
mean   20.500000
std     1.290994
min    19.000000
25%    19.750000
50%    20.500000
75%    21.250000
max    22.000000

##### 當作用與類別型的時候：

In [56]:
df['Name'].describe()   # 返回非空值數、類別數、众數（只返回一個）、众數出現的頻率數

count      4
unique     4
top       Oz
freq       1
Name: Name, dtype: object

In [55]:
df

     Name  Age  Class  PhoneNum  IDNum Gender
0    Mary   22   1401  18734444      1      F
1      Oz   21   1401  18734445      2      M
2   Jerry   20   1401  18767442      3      M
3  Olivia   19   1402  16098232      4      F

##### 練習：

In [64]:
detail = pd.read_excel('meal_order_detail.xlsx')
detail

,detail_id,order_id,dishes_id,logicprn_name,parent_class_name,dishes_name,itemis_add,counts,amounts,cost,place_order_time,discount_amt,discount_reason,kick_back,add_inprice,add_info,bar_code,picture_file,emp_id
0,2956,417,610062,NaN,NaN,蒜蓉生蚝,0,1,49,NaN,2016-08-01 11:05:36,NaN,NaN,NaN,0,NaN,NaN,caipu/104001.jpg,1442
1,2958,417,609957,NaN,NaN,蒙古烤羊腿,0,1,48,NaN,2016-08-01 11:07:07,NaN,NaN,NaN,0,NaN,NaN,caipu/202003.jpg,1442
2,2961,417,609950,NaN,NaN,大蒜苋菜,0,1,30,NaN,2016-08-01 11:07:40,NaN,NaN,NaN,0,NaN,NaN,caipu/303001.jpg,1442
3,2966,417,610038,NaN,NaN,芝麻烤紫菜,0,1,25,NaN,2016-08-01 11:11:11,NaN,NaN,NaN,0,NaN,NaN,caipu/105002.jpg,1442
4,2968,417,610003,NaN,NaN,蒜香包,0,1,13,NaN,2016-08-01 11:11:30,NaN,NaN,NaN,0,NaN,NaN,caipu/503002.jpg,1442
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2774,6750,774,610011,NaN,NaN,白饭/大碗,0,1,10,NaN,2016-08-10 21:56:24,NaN,NaN,NaN,0,NaN,NaN,caipu/601005.jpg,1138
2775,6742,774,609996,NaN,NaN,牛尾汤,0,1,40,NaN,2016-08-10 21:56:48,NaN,NaN,NaN,0,NaN,NaN,caipu/201006.jpg,1138
2776,6756,774,609949,NaN,NaN,意文柠檬汁,0,1,13,NaN,2016-08-10 22:01:52,NaN,NaN,NaN,0,NaN,NaN,caipu/404005.jpg,1138
2777,6763,774,610014,NaN,NaN,金玉良缘,0,1,30,NaN,2016-08-10 22:03:58,NaN,NaN,NaN,0,NaN,NaN,caipu/302003.jpg,1138
2778,6764,774,610017,NaN,NaN,酸辣藕丁,0,1,33,NaN,2016-08-10 22:04:30,NaN,NaN,NaN,0,NaN,NaN,caipu/302006.jpg,1138

In [65]:
detail['dishes_name'].describe()

count      2779
unique      157
top       白饭/大碗
freq         92
Name: dishes_name, dtype: object

In [67]:
df['is_Check'] = [0, 1, 1, 0]

In [68]:
df

     Name  Age  Class  PhoneNum  IDNum Gender  is_Check
0    Mary   22   1401  18734444      1      F         0
1      Oz   21   1401  18734445      2      M         1
2   Jerry   20   1401  18767442      3      M         1
3  Olivia   19   1402  16098232      4      F         0

In [69]:
df['is_Check'].describe()  #會返回數值型的錯誤

count    4.00000
mean     0.50000
std      0.57735
min      0.00000
25%      0.00000
50%      0.50000
75%      1.00000
max      1.00000
Name: is_Check, dtype: float64

##### <font color = "red"> 需要強轉成類別型來describe </font>

In [116]:
df['is_Check'].astype('category').describe()

count     4
unique    2
top       1
freq      2
Name: is_Check, dtype: int64

##### 練習：1. 對表格清洗，刪除表中左右為Nan值的列，或者刪除取值相同的列 <br> 2.刪除列表中列的值全部相同的

In [108]:
mask = detail.count() == 0   #非空值為0，則整列都是Nan,返回一個Bool的數列
label_nan = mask.index[mask] 
detail.drop(labels = label_nan, axis = 1, inplace = True)
detail

,detail_id,order_id,dishes_id,dishes_name,itemis_add,counts,amounts,place_order_time,add_inprice,picture_file,emp_id
0,2956,417,610062,蒜蓉生蚝,0,1,49,2016-08-01 11:05:36,0,caipu/104001.jpg,1442
1,2958,417,609957,蒙古烤羊腿,0,1,48,2016-08-01 11:07:07,0,caipu/202003.jpg,1442
2,2961,417,609950,大蒜苋菜,0,1,30,2016-08-01 11:07:40,0,caipu/303001.jpg,1442
3,2966,417,610038,芝麻烤紫菜,0,1,25,2016-08-01 11:11:11,0,caipu/105002.jpg,1442
4,2968,417,610003,蒜香包,0,1,13,2016-08-01 11:11:30,0,caipu/503002.jpg,1442
...,...,...,...,...,...,...,...,...,...,...,...
2774,6750,774,610011,白饭/大碗,0,1,10,2016-08-10 21:56:24,0,caipu/601005.jpg,1138
2775,6742,774,609996,牛尾汤,0,1,40,2016-08-10 21:56:48,0,caipu/201006.jpg,1138
2776,6756,774,609949,意文柠檬汁,0,1,13,2016-08-10 22:01:52,0,caipu/404005.jpg,1138
2777,6763,774,610014,金玉良缘,0,1,30,2016-08-10 22:03:58,0,caipu/302003.jpg,1138
2778,6764,774,610017,酸辣藕丁,0,1,33,2016-08-10 22:04:30,0,caipu/302006.jpg,1138

In [136]:
freq = detail.astype('category').describe().loc['freq',]
mask_freq = freq == detail.shape[0]
label_sim = mask_freq.index[mask_freq]
detail.drop(labels = label_sim, axis = 1, inplace = True)
detail

,detail_id,order_id,dishes_id,dishes_name,counts,amounts,place_order_time,picture_file,emp_id
0,2956,417,610062,蒜蓉生蚝,1,49,2016-08-01 11:05:36,caipu/104001.jpg,1442
1,2958,417,609957,蒙古烤羊腿,1,48,2016-08-01 11:07:07,caipu/202003.jpg,1442
2,2961,417,609950,大蒜苋菜,1,30,2016-08-01 11:07:40,caipu/303001.jpg,1442
3,2966,417,610038,芝麻烤紫菜,1,25,2016-08-01 11:11:11,caipu/105002.jpg,1442
4,2968,417,610003,蒜香包,1,13,2016-08-01 11:11:30,caipu/503002.jpg,1442
...,...,...,...,...,...,...,...,...,...
2774,6750,774,610011,白饭/大碗,1,10,2016-08-10 21:56:24,caipu/601005.jpg,1138
2775,6742,774,609996,牛尾汤,1,40,2016-08-10 21:56:48,caipu/201006.jpg,1138
2776,6756,774,609949,意文柠檬汁,1,13,2016-08-10 22:01:52,caipu/404005.jpg,1138
2777,6763,774,610014,金玉良缘,1,30,2016-08-10 22:03:58,caipu/302003.jpg,1138
2778,6764,774,610017,酸辣藕丁,1,33,2016-08-10 22:04:30,caipu/302006.jpg,1138

##### 轉換與處理時間序列：

In [157]:
detail['place_order_time'] = pd.to_datetime(detail.place_order_time) #返回Datatime類型
detail['place_order_time'].dtype

dtype('<M8[ns]')

In [161]:
detail.place_order_time[0]

Timestamp('2016-08-01 11:05:36')

In [159]:
detail.place_order_time[0].year

2016

In [160]:
detail.place_order_time[0].month

8

In [162]:
detail.place_order_time[0].day

1

In [163]:
detail.place_order_time[0].hour

11

In [165]:
detail.place_order_time[0].minute

5

In [167]:
detail.place_order_time[0].second

36

In [168]:
detail.place_order_time[0].dayofyear #顯示一年中的第幾天

214

In [169]:
detail.place_order_time[0].quarter # 顯示季節

3

In [175]:
detail.place_order_time[0].dayofweek #顯示一週中的第幾天

0

In [209]:
detail.place_order_time[0].day_name() #顯示星期

'Monday'

In [235]:
detail.place_order_time[0].date()

datetime.date(2016, 8, 1)

##### 提取整列的年份： <font color = "red"> dt </font>

In [225]:
simpletime.dt.year

0       2016
1       2016
2       2016
3       2016
4       2016
        ...
2774    2016
2775    2016
2776    2016
2777    2016
2778    2016
Name: place_order_time, Length: 2779, dtype: int64

In [229]:
simpletime.dt.day_name()

0          Monday
1          Monday
2          Monday
3          Monday
4          Monday
          ...
2774    Wednesday
2775    Wednesday
2776    Wednesday
2777    Wednesday
2778    Wednesday
Name: place_order_time, Length: 2779, dtype: object

In [233]:
simpletime.dt.date

0       2016-08-01
1       2016-08-01
2       2016-08-01
3       2016-08-01
4       2016-08-01
           ...
2774    2016-08-10
2775    2016-08-10
2776    2016-08-10
2777    2016-08-10
2778    2016-08-10
Name: place_order_time, Length: 2779, dtype: object

------------------------

In [227]:
[i * 2 for i in range(10)] # 推倒式

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]

---------------------------

##### 時間的運算：

In [237]:
simpletime + pd.Timedelta(days = 1) #將日期整體向後平移一天

0      2016-08-02 11:05:36
1      2016-08-02 11:07:07
2      2016-08-02 11:07:40
3      2016-08-02 11:11:11
4      2016-08-02 11:11:30
               ...
2774   2016-08-11 21:56:24
2775   2016-08-11 21:56:48
2776   2016-08-11 22:01:52
2777   2016-08-11 22:03:58
2778   2016-08-11 22:04:30
Name: place_order_time, Length: 2779, dtype: datetime64[ns]

##### 求用餐時間的均值：

In [288]:
order = pd.read_csv('meal_order_info.csv', encoding = 'gbk', sep = ',')

In [289]:
order.use_start_time = pd.to_datetime(order.use_start_time) #把時間轉換成標準時間格式
order.lock_time = pd.to_datetime(order.lock_time)
during = order.lock_time - order.use_start_time

##### 設定條件：

In [290]:
mask = (during < pd.to_timedelta(0)) | (during.dt.days > 1) #設定條件：時間為負值，或者大於1天的。
mask.index[mask]

Int64Index([ 82, 106, 115, 118, 128, 170, 188, 197, 215, 220, 303, 321, 429,
            433, 439, 513, 518, 526, 527, 551, 560, 567, 625, 785, 806, 828,
            843, 896, 944],
           dtype='int64')

In [293]:
during.drop(labels = mask.index[mask], axis = 0, inplace = True) #根據條件刪除無效的數據

In [295]:
during.shape

(916,)

In [296]:
during.mean()  #算出平均的點餐時間

Timedelta('0 days 00:11:20.639470')

##### 求菜品賣得最好的前5個

In [310]:
mask = detail.dishes_name.str.contains('白饭') #刪除白飯類型的菜品
detail.drop(mask.index[mask], axis = 0, inplace = True)
detail.dishes_name.value_counts().head()

凉拌菠菜         77
谷稻小庄         72
麻辣小龙虾        65
五色糯米饭(七色)    58
焖猪手          55
Name: dishes_name, dtype: int64